app/controllers/pins_controller.rb

	def index
		@pins = Pin.all.order(created_at: :desc)
---
SELECT "pins".* FROM "pins" ORDER BY "pins"."created_at" DESC

	def create
		@pin = current_user.pins.build(pin_params)

		if @pin.save
---
INSERT INTO "pins" ("title", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "this is 2nd listing"], ["description", "this will succeed"], ["created_at", "2017-05-29 08:56:34.452769"], ["updated_at", "2017-05-29 08:56:34.452769"], ["user_id", 1]]

	def update
		if @pin.update(pin_params)
---
UPDATE "pins" SET "pictures" = $1, "updated_at" = $2 WHERE "pins"."id" = $3  [["pictures", "[\"b.jpg\",\"67849b2aa15be4c63f39f02508ee14fd.jpg\",\"traditional.JPG\",\"old_people.jpg\"]"], ["updated_at", "2017-05-29 10:48:16.827783"], ["id", 6]]

	def find_pin
		@pin = Pin.find(params[:id])
---
SELECT  "pins".* FROM "pins" WHERE "pins"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]